[
 {
  "DOI": "https://doi.org/10.1007/s00429-022-02518-6",
  "abstract": "Efficient communication across fields of research is challenging, especially when they are at opposite ends of the physical and digital spectrum. Neuroanatomy and neuroimaging may seem close to each other. When neuroimaging studies try to isolate structures of interest, according to a specific anatomical definition, a variety of challenges emerge. It is a non-trivial task to convert the neuroanatomical knowledge to instructions and rules to be executed in neuroimaging software. In the process called “virtual dissection” used to isolate coherent white matter structure in tractography, each white matter pathway has its own set of landmarks (regions of interest) used as inclusion and exclusion criteria. The ability to segment and study these pathways is critical for scientific progress, yet, variability may depend on region placement, and be influenced by the person positioning the region (i.e., a rater). When raters’ variability is taken into account, the impact made by each region of interest becomes even more difficult to interpret. A delicate balance between anatomical validity, impact on the virtual dissection and raters’ reproducibility emerge. In this work, we investigate this balance by leveraging manual delineation data of a group of raters from a previous study to quantify which set of landmarks and criteria contribute most to variability in virtual dissection. To supplement our analysis, the variability of each pathway with a region-by-region exploration was performed. We present a detailed exploration and description of each region, the causes of variability and its impacts. Finally, we provide a brief overview of the lessons learned from our previous virtual dissection projects and propose recommendations for future virtual dissection protocols as well as perspectives to reach better community agreement when it comes to anatomical definitions of white matter pathways.",
  "author": [
   {
    "family": "Rheault",
    "given": "Francois"
   },
   {
    "family": "Schilling",
    "given": "Kurt G"
   },
   {
    "family": "Obaid",
    "given": "Sami"
   },
   {
    "family": "Begnoche",
    "given": "John P"
   },
   {
    "family": "Cutting",
    "given": "Laurie E"
   },
   {
    "family": "Descoteaux",
    "given": "Maxime"
   },
   {
    "family": "Landman",
    "given": "Bennett A"
   },
   {
    "family": "Petit",
    "given": "Laurent"
   }
  ],
  "container-title": "Brain Structure and Function",
  "image": "rheault2022influence.png",
  "issued": {
   "date-parts": [
    [
     "2022",
     2
    ]
   ]
  },
  "title": "The influence of regions of interest on tractography virtual dissection protocols: general principles to learn and to follow"
 }
]